Digital_First_PI_v1.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="QA_Digital" enabled="true">
      <stringProp name="TestPlan.comments">This test plan was created by the BlazeMeter converter v.2.4.18. Please contact support@blazemeter.com for further support.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(p_vuser,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(p_rampup,300)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(p_duration,600)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">2000</stringProp>
          <stringProp name="RandomTimer.range">1000</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API_1_locations/search/by-city-state" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api.test.c.pfcld.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/location-composite-ms/locations/search/by-city-state?state-code=SC&amp;city=Greenville</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">510064400</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="&apos;Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJweXlIeGtQYWdBWUNzZTlsdmk2bUdGSDNoX28wbi0zem5YdmxFeHJWUXFFIiwiYWxnIjoiUlMyNTYifQ.eyJ2ZXIiOjEsImp0aSI6IkFULmVQSmZ2ZWNPS1JXZldyZGR3VW90RVQ3UFRTdWQzakl4Y1lDZDJYVkg2cVEiLCJpc3MiOiJodHRwczovL2FkdmFuY2VhbWVyaWNhY29uc3VtZXIub2t0YXByZXZpZXcuY29tL29hdXRoMi9hdXMxZTBqOHM4Y1kxNEJNSjFkNyIsImF1ZCI6ImFwaTovL2ludGVybmFsIiwiaWF0IjoxNjM1Nzg5MTg2LCJleHAiOjE2MzU3OTI3ODYsImNpZCI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3Iiwic2NwIjpbInNlbGYiLCJBZG1pbiIsIkludGVybmFsIl0sInN1YiI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3In0.HbsYqN0zPy_3XlQ79Trtz5zCYlOz9kagYTzVHuHjdNF4PR2zbIc7MwM3LQhsOZZ_ibxla4QWb3PPGGJ_nGkAta2zJnWK-CKidEucAnnpQRaYk3XAWWFv-70budqnArVDbebP3CtnI-xABr6jgEArY5moqiltDTFR7vZG6xHYAhO3ASHtuRC0crKytAZDcPcO3DwLVoZInTvI6PH7jrL5mWtmMokT5R-UT20JsnidqgvEirlxSVWH2KKCDJZRcysRTk8upQ_TTwJ-iaBdORSiUX2j1ksFIPu2k9eM8vj6_3DiX7Umm0Z9qRS6_MZVL5rRs2LehrB1YDKeiWyOhtr-fw</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1541836720">locationId</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API_2_locations/search/by-zip-code" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api.test.c.pfcld.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">v1/location-composite-ms/locations/search/by-zip-code?zip-code=29609</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">510064400</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="&apos;Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJweXlIeGtQYWdBWUNzZTlsdmk2bUdGSDNoX28wbi0zem5YdmxFeHJWUXFFIiwiYWxnIjoiUlMyNTYifQ.eyJ2ZXIiOjEsImp0aSI6IkFULmVQSmZ2ZWNPS1JXZldyZGR3VW90RVQ3UFRTdWQzakl4Y1lDZDJYVkg2cVEiLCJpc3MiOiJodHRwczovL2FkdmFuY2VhbWVyaWNhY29uc3VtZXIub2t0YXByZXZpZXcuY29tL29hdXRoMi9hdXMxZTBqOHM4Y1kxNEJNSjFkNyIsImF1ZCI6ImFwaTovL2ludGVybmFsIiwiaWF0IjoxNjM1Nzg5MTg2LCJleHAiOjE2MzU3OTI3ODYsImNpZCI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3Iiwic2NwIjpbInNlbGYiLCJBZG1pbiIsIkludGVybmFsIl0sInN1YiI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3In0.HbsYqN0zPy_3XlQ79Trtz5zCYlOz9kagYTzVHuHjdNF4PR2zbIc7MwM3LQhsOZZ_ibxla4QWb3PPGGJ_nGkAta2zJnWK-CKidEucAnnpQRaYk3XAWWFv-70budqnArVDbebP3CtnI-xABr6jgEArY5moqiltDTFR7vZG6xHYAhO3ASHtuRC0crKytAZDcPcO3DwLVoZInTvI6PH7jrL5mWtmMokT5R-UT20JsnidqgvEirlxSVWH2KKCDJZRcysRTk8upQ_TTwJ-iaBdORSiUX2j1ksFIPu2k9eM8vj6_3DiX7Umm0Z9qRS6_MZVL5rRs2LehrB1YDKeiWyOhtr-fw</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1541836720">locationId</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="API_3_location-composite-ms/locations" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">api.test.c.pfcld.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/location-composite-ms/locations/6874</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">510064400</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="&apos;Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJraWQiOiJweXlIeGtQYWdBWUNzZTlsdmk2bUdGSDNoX28wbi0zem5YdmxFeHJWUXFFIiwiYWxnIjoiUlMyNTYifQ.eyJ2ZXIiOjEsImp0aSI6IkFULmVQSmZ2ZWNPS1JXZldyZGR3VW90RVQ3UFRTdWQzakl4Y1lDZDJYVkg2cVEiLCJpc3MiOiJodHRwczovL2FkdmFuY2VhbWVyaWNhY29uc3VtZXIub2t0YXByZXZpZXcuY29tL29hdXRoMi9hdXMxZTBqOHM4Y1kxNEJNSjFkNyIsImF1ZCI6ImFwaTovL2ludGVybmFsIiwiaWF0IjoxNjM1Nzg5MTg2LCJleHAiOjE2MzU3OTI3ODYsImNpZCI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3Iiwic2NwIjpbInNlbGYiLCJBZG1pbiIsIkludGVybmFsIl0sInN1YiI6IjBvYTFlMHNuNXhFTWN4Rzh2MWQ3In0.HbsYqN0zPy_3XlQ79Trtz5zCYlOz9kagYTzVHuHjdNF4PR2zbIc7MwM3LQhsOZZ_ibxla4QWb3PPGGJ_nGkAta2zJnWK-CKidEucAnnpQRaYk3XAWWFv-70budqnArVDbebP3CtnI-xABr6jgEArY5moqiltDTFR7vZG6xHYAhO3ASHtuRC0crKytAZDcPcO3DwLVoZInTvI6PH7jrL5mWtmMokT5R-UT20JsnidqgvEirlxSVWH2KKCDJZRcysRTk8upQ_TTwJ-iaBdORSiUX2j1ksFIPu2k9eM8vj6_3DiX7Umm0Z9qRS6_MZVL5rRs2LehrB1YDKeiWyOhtr-fw</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1541836720">locationId</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>